{
    "language": {
        "no": {
            "NavbarFooter": {
                "contactInformation": "Kontaktinformasjon",
                "locationText": "Beliggenhet",
                "map-consent-text": "Google maps kan samle inn brukerdata, for å se kart må du godta.",
                "map-consent-button": "Godta",
                "deviceTheme": "Enhet",
                "darkTheme": "Mørk",
                "purpleTheme": "Lilla",
                "lightTheme": "Lys",
                "orangeTheme": "Oransje",
                "homeLink": "Hjemmeside",
                "educationLink": "Utdanning",
                "workExperienceLink": "Jobberfaring",
                "hobbiesLink": "Hobbyer",
                "gamesLink": "Spill"
            },
            "404": {
                "siteNotFound": "Denne siden finnes ikke",
                "goToPage": "Gå til en av disse sidene:",
                "home404": "Hjemmeside",
                "education404": "Utdanning",
                "workExperience404": "Jobberfaring",
                "hobbies404": "Hobbyer",
                "games404": "Spill"
            },
            "home": {
                "homeAge": "2006, <span id=\"age\"></span> år gammel",
                "homeLocation": "Fredrikstad, Norge",
                "homeAboutHeading": "Litt om meg",
                "homeAboutText": "Jeg er en <strong>ansvarlig, ryddig og snill</strong> gutt på <span id=\"age\"></span> år. Jeg lærer raskt og gjør mitt beste. Jeg tenker grundig igjennom ting før jeg gjør det og jeg er ganske <strong>selvstendig</strong>.",
                "homeInterestsHeading": "Interesser",
                "homeInterestsText": "Jeg har interesse for <strong>datamaskiner, programmering, nettverk og gaming.</strong>",
                "homeInterestsMoreInfo": "Mer info på hobby siden...",
                "homeCodingLanguagesHeading": "Kodespråk jeg har jobbet med",
                "codingLangugeProjects": "Prosjekter:",
                "show-more": "Vis mer...",
                "codingLanguageLocalForNow": "Bare lokale prosjekter for øyeblikket...",
                "educationHeading": "Min utdanningsplan",
                "educationText": "Planen min er å gå informasjonsteknologi og medieproduksjon på vg1, og så i vg2, informasjonsteknologi. I vg3 så blir det IT-utviklerfaget. Hvis jeg ikke er førnøyd med valget mitt så skal jeg prøve å bytte over til IT-driftsfaget. Til vg1 så valgte jeg IT-utvikler for YFF.",
                "educationAmbitions": "Mine ambisjoner",
                "educationAmbitionsText": "Mine ambisjoner i livet er å få en godt betalt jobb hvor jeg trives og kan bidra på en positiv måte. Jeg ønsker også å utvikle mine ferdigheter innenfor programmering og teknologi.",
                "educationSchoolsHeading": "Skoler jeg har gått på",
                "educationSchoolsGlemmenTitle": "Glemmen videregående skole <span class=\"time\">2022 → nå</span>",
                "educationSchoolsGlemmenReview": "Denne skolen er ganske digg å gå på.",
                "educationSchoolsGlemmenLine": "vg1 linje: Informasjonsteknologi og medieproduksjon.",
                "educationSchoolsBorgeTitle": "Borge ungdomsskole <span class=\"time\">2019 → 2022</span>",
                "educationSchoolsBorgeReview": "I løpet av ungdomsskolen så hadde interessen min for datamaskiner blitt til en hobby. På denne tiden kunne jeg allerede mye om datamaskiner, men jeg kunne ikke så mye om programmering. I 10. klasse så valgte jeg programmering som valgfag og det var da jeg fikk en god smak for koding. Der så lærte jeg å kode i Python og Scratch.",
                "educationSchoolsArumTitle": "Årum skole <span class=\"time\">2012 → 2019</span>",
                "educationSchoolsArumReview": "Dette var den første skolen jeg gikk på, det var i løpet av denne tiden jeg fikk en interesse innenfor datamaskiner og programmering.",
                "educationLinkToSchool": "Link til skolen",
                "workExperienceHeading": "Jobberfaringer",
                "paintBtn": "Male hus",
                "paintDrop": "I sommeren 2022 så hjalp jeg til med å male huset, jeg gjorde en god jobb.",
                "vacuumingBtn": "Støvsuging",
                "vaccumDrop": "Jeg støvsuger alltid rommet mitt når jeg ser det er støv, noen ganger så støvsuger jeg også huset når jeg føler for det.",
                "takeOutTrashBtn": "Ta ut søppel",
                "takeOutTrashDrop": "Noen ganger så kaster jeg søppla vi har ute i søppel dunken, men jeg pleier oftest bare å gjøre det når jeg har en del søppel på rommet mitt som ikke har plass inne.",
                "otherJobsHomeBtn": "Andre jobber hjemme",
                "otherJobsHomeDrop": "Jeg pleier oftest å reparere og installere ting i huset, så langt har jeg fikset dører, lamper, datamaskiner internett og mer. Jeg har også installert et vindu, røykvarsler, persienner, ovner og mer. <br> Jeg legger også ting ut og inn i oppvaskmaskinen og legger ved i ovnen. Jeg klarer også lage ild.",
                "jobsMyRoomBtn": "Jobber inne på rommet mitt",
                "jobsMyRoomDrop": "Inne på rommet mitt sørger jeg alltid for at det er ryddig og pent. Jeg rer opp senga, støvsuger, vasker bort støv, vanner blomster og legger klær inn i skapet.",
                "hobbiesHeading": "Mine hobbyer",
                "hobbiesText": "Hobbiene mine er innenfor <a href=\"#gaming\">Gaming,</a> <a href=\"#computers\">datamaskiner,</a> <a href=\"#programming\">programmering.</a> Jeg starta å bli interesert i gaming og data rundt sånn 2017. Programmering kom noen få år etter. Innenfor gaming så liker jeg mer rolige spill og spill hvor du må tenke litt. De spillene jeg liker er mest er fabrikk spill.",
                "gamePurchased": "Kjøpt: ",
                "hoursPlayed": "Timer spilt: ",
                "satisfactoryDesc": "Satisfactory er et førstepersons åpen-verden fabrikkbyggespill med en dash av utforskning og kamp. Spill alene eller sammen med venner, utforsk en fremmed planet, lag fabrikker med flere etasjer og gå inn i båndhimmelen!",
                "spaceengineersDesc": "Space Engineers er et sandkassespill om konstruksjon, konstruksjon, utforskning og overlevelse i verdensrommet og på planeter. Spillere bygger romskip, romstasjoner, planetariske utposter av ulik størrelse og bruk, pilotskip og reiser gjennom verdensrommet for å utforske planeter og samle ressurser for å overleve.",
                "dysonsphereprogramDesc": "Bygg den mest effektive intergalaktiske fabrikken i romsimuleringsstrategispillet Dyson Sphere Program! Utnytt kraften til stjernene, samle ressurser, planlegg og design produksjonslinjer og utvik din interstellare fabrikk fra et lite romverksted til et galakseomfattende industriimperium.",
                "eurotrucksim2Desc": "Reis over hele Europa som konge av veien, en lastebilsjåfør som leverer viktig last over imponerende avstander! Med dusinvis av byer å utforske, vil din utholdenhet, dyktighet og hastighet bli presset til sine grenser.",
                "gamesHeading": "Spill",
                "gamesText": "Her her er alle spillene jeg har lagd i HTML og JavaScript",
                "game-start": "Start spill!",
                "drumKitDesc": "Spill virtuelle trommelyder ved å bruke tastaturet eller trykke på hver tast i dette ikke så engasjerende trommesettespillet.",
                "simonGameDesc": "Test hukommelsen din med et gjentatte fargeglimt! Sekvensen blir lengre for hver vellykket repetisjon. Hvor langt kan du gå? Skjerp ferdighetene dine og nyt det vanedannende spillet!",
                "diceGameDesc": "Leter du etter en enkel måte å løse saker på? Bare kast terningen! Enten du spiller med to eller flere spillere, får hver person sine egne terninger. Spilleren som kaster det høyeste tallet vinner. Det er et enkelt og engasjerende spill som alle kan glede seg over!"
            }
        },
        "en": {
            "NavbarFooter": {
                "contactInformation": "Contact Information",
                "locationText": "Location",
                "map-consent-text": "Google Maps may collect user data, to view the map you need to consent.",
                "map-consent-button": "Accept",
                "deviceTheme": "Device",
                "darkTheme": "Dark",
                "purpleTheme": "Purple",
                "lightTheme": "Light",
                "orangeTheme": "Orange",
                "homeLink": "Home",
                "educationLink": "Education",
                "workExperienceLink": "Work experience",
                "hobbiesLink": "Hobbies",
                "gamesLink": "Games"
            },
            "404": {
                "siteNotFound": "This site does not exist",
                "goToPage": "Go to one of these pages:",
                "home404": "Home",
                "education404": "Education",
                "workExperience404": "Work experience",
                "hobbies404": "Hobbies",
                "games404": "Games"
            },
            "home": {
                "homeAge": "2006, <span id=\"age\"></span> years old",
                "homeLocation": "Fredrikstad, Norway",
                "homeAboutHeading": "A bit about me",
                "homeAboutText": "I am a <strong>responsible, tidy and kind</strong> <span id=\"age\"></span>-year-old boy. I learn quickly and do my best. I think things through thoroughly before I do it, and I am quite <strong>independent</strong>.",
                "homeInterestsHeading": "Interests",
                "homeInterestsText": "I have an interest in <strong>computers, programming, networking and gaming.</strong>",
                "homeInterestsMoreInfo": "More info on the hobby page...",
                "homeCodingLanguagesHeading": "Coding languages I have worked with",
                "codingLangugeProjects": "Projects:",
                "show-more": "Show more...",
                "codingLanguageLocalForNow": "Only local projects for now...",
                "educationHeading": "My education plan",
                "educationText": "I plan to go to information technology and media production in year 1, and then in year 2, information technology. In vg3, it will be the IT developer subject. If I am not satisfied with my choice, I will try to switch to the IT operations subject. For vg1, I chose IT developer for YFF.",
                "educationAmbitions": "My ambitions:",
                "educationAmbitionsText": "My ambitions in life are to get a well-paid job where I enjoy myself and can contribute positively. I also want to develop my skills in programming and technology.",
                "educationSchoolsHeading": "Schools I have attended",
                "educationSchoolsGlemmenTitle": "Glemmen high school <span class=\"time\">2022 → now</span>",
                "educationSchoolsGlemmenReview": "This school is pretty cool to go to.",
                "educationSchoolsGlemmenLine": "vg1 line: Information technology and media production.",
                "educationSchoolsBorgeTitle": "Borge secondary school <span class=\"time\">2019 → 2022</span>",
                "educationSchoolsBorgeReview": "During secondary school, my interest in computers had turned into a hobby. At this time I already knew a lot about computers, but I didn't know much about programming. In the 10th grade, I chose programming as an elective and that's when I got a good taste for coding. There I learned to code in Python and Scratch.",
                "educationSchoolsArumTitle": "Årum school <span class=\"time\">2012 → 2019</span>",
                "educationSchoolsArumReview": "This was the first school I attended, it was during this time that I became interested in computers and programming.",
                "educationLinkToSchool": "Link to the school",
                "workExperienceHeading": "Work experiences",
                "paintBtn": "Painting the house",
                "paintDrop": "In the summer of 2022, I helped paint the house, I did a good job.",
                "vacuumingBtn": "Vacuuming",
                "vaccumDrop": "I always vacuum my room when I see dust, sometimes I also vacuum the house when I feel like it.",
                "takeOutTrashBtn": "Take out the trash",
                "takeOutTrashDrop": "Sometimes I throw the rubbish we have outside into the rubbish bin, but I usually only do it when I have a lot of rubbish in my room that doesn&#39;t fit inside.",
                "otherJobsHomeBtn": "Other work at home",
                "otherJobsHomeDrop": "I usually repair and install things in the house, so far I have fixed doors, lamps, computers, internet and more. I have also installed a window, smoke alarms, blinds, heaters and more.&#10; I also put things in and out of the dishwasher and put wood in the oven. I can also make fire.",
                "jobsMyRoomBtn": "Work in my room",
                "jobsMyRoomDrop": "Inside my room, I always make sure it is neat. I make the bed, vacuum, wash away dust, water flowers and put clothes in the closet.",
                "hobbiesHeading": "My hobbies",
                "hobbiesText": "My hobbies are <a href=\"#gaming\">gaming,</a> <a href=\"#computers\">computers,</a> and <a href=\"#programming\">programming.</a> I started getting interested in gaming and computers around 2017. Programming came a few years later. Within gaming, I like quiet games and games where you have to think a bit. The games I like the most are factory games.",
                "gamePurchased": "Purchased: ",
                "hoursPlayed": "Hours played: ",
                "satisfactoryDesc": "Satisfactory is a first-person open-world factory building game with a dash of exploration and combat. Play alone or with friends, explore an alien planet, create multi-story factories, and enter conveyor belt heaven!",
                "spaceengineersDesc": "Space Engineers is a sandbox game about engineering, construction, exploration and survival in space and on planets. Players build space ships, space stations, planetary outposts of various sizes and uses, pilot ships and travel through space to explore planets and gather resources to survive.",
                "dysonsphereprogramDesc": "Build the most efficient intergalactic factory in space simulation strategy game Dyson Sphere Program! Harness the power of stars, collect resources, plan and design production lines and develop your interstellar factory from a small space workshop to a galaxy-wide industrial empire.",
                "eurotrucksim2Desc": "Travel across Europe as king of the road, a trucker who delivers important cargo across impressive distances! With dozens of cities to explore, your endurance, skill and speed will all be pushed to their limits.",
                "gamesHeading": "Games",
                "gamesText": "Here are all the games I have made in HTML and JavaScript",
                "game-start": "Start the game!",
                "drumKitDesc": "Play virtual drum noises by using your keyboard or pressing on each key in this not so engaging drum kit game.",
                "simonGameDesc": "Test your memory with a repeating flash of colors! The sequence grows longer with each successful repeat. How far can you go? Sharpen your skills and enjoy the addictive gameplay!",
                "diceGameDesc": "Looking for a straightforward way to settle matters? Just roll the dice! Whether you're playing with two players or more, each person gets their own dice. The player who rolls the highest number wins. It's a simple and engaging game that anyone can enjoy!"
            }
        },
        "de": {
            "404": {
                "siteNotFound": "Diese Seite existiert nicht !",
                "goToPage": "Gehen Sie zu einer dieser Seiten:",
                "home404": "Webseite",
                "education404": "Erziehung und Ausbildung",
                "workExperience404": "Arbeitserfahrung",
                "hobbies404": "Hobbys",
                "games404": "Spiele"
            },
            "NavbarFooter": {
                "contactInformation": "Kontaktinformationen",
                "locationText": "Ort. Sicherheit.",
                "map-consent-text": "Google Maps kann Benutzerdaten sammeln. Um Karten anzuzeigen, müssen Sie diese akzeptieren.",
                "map-consent-button": "Akzeptieren",
                "deviceTheme": "Einheit",
                "darkTheme": "Schwarz.",
                "purpleTheme": "Violett",
                "lightTheme": "Licht",
                "orangeTheme": "Orange",
                "homeLink": "Webseite",
                "educationLink": "Erziehung und Ausbildung",
                "workExperienceLink": "Arbeitserfahrung",
                "hobbiesLink": "Hobbys",
                "gamesLink": "Spiele"
            },
            "home": {
                "homeAge": "2006, <span id=\"age\"></span> Jahre alt",
                "homeLocation": "Fredrikstad, Norwegen",
                "homeAboutHeading": "Etwas über mich",
                "homeAboutText": "Ich bin ein <strong>verantwortungsbewusster, ordentlicher und freundlicher</strong> Junge <span id=\"age\"></span> Jahr. Ich lerne schnell und gebe mein Bestes. Ich denke die Dinge gründlich durch, bevor ich sie tue, und bin ziemlich <strong>unabhängig</strong> .",
                "homeInterestsHeading": "Meine Hobbys...",
                "homeInterestsText": "Ich interessiere mich für <strong>Computer, Programmierung, Netzwerke und Spiele.</strong>",
                "homeInterestsMoreInfo": "Weitere Infos auf der Hobbyseite...",
                "homeCodingLanguagesHeading": "Codesprache, mit der ich gearbeitet habe",
                "codingLangugeProjects": "Projekte:",
                "show-more": "Zeig mehr...",
                "codingLanguageLocalForNow": "Vorerst nur lokale Projekte...",
                "educationHeading": "Mein Bildungsplan",
                "educationText": "Mein Plan ist es, im ersten Jahr Informationstechnologie und Medienproduktion zu studieren und dann im zweiten Jahr Informationstechnologie. In vg3 wird es das Fach IT-Entwickler sein. Sollte ich mit meiner Wahl nicht zufrieden sein, werde ich versuchen, in das Fach IT-Betrieb zu wechseln. Für vg1 habe ich mich für einen IT-Entwickler für YFF entschieden.",
                "educationAmbitions": "Meine Ambitionen",
                "educationAmbitionsText": "Mein Lebensziel ist es, einen gut bezahlten Job zu bekommen, bei dem ich Spaß habe und einen positiven Beitrag leisten kann. Ich möchte auch meine Fähigkeiten in Programmierung und Technologie weiterentwickeln.",
                "educationSchoolsHeading": "Schulen, die ich besucht habe",
                "educationSchoolsGlemmenTitle": "Glemmen-Oberschule <span class=\"time\">2022 → jetzt</span>",
                "educationSchoolsGlemmenReview": "Es ist ziemlich cool, diese Schule zu besuchen.",
                "educationSchoolsGlemmenLine": "vg1-Linie: Informationstechnologie und Medienproduktion.",
                "educationSchoolsBorgeTitle": "Borge-Oberschule <span class=\"time\">2019 → 2022</span>",
                "educationSchoolsBorgeReview": "Während der weiterführenden Schule hatte sich mein Interesse an Computern zu einem Hobby entwickelt. Zu diesem Zeitpunkt wusste ich bereits viel über Computer, aber nicht viel über Programmierung. In der 10. Klasse habe ich Programmieren als Wahlfach gewählt und da habe ich einen guten Geschmack für das Programmieren bekommen. Dort habe ich gelernt, in Python und Scratch zu programmieren.",
                "educationSchoolsArumTitle": "Årum-Schule <span class=\"time\">2012 → 2019</span>",
                "educationSchoolsArumReview": "Dies war die erste Schule, die ich besuchte. In dieser Zeit begann ich, mich für Computer und Programmierung zu interessieren.",
                "educationLinkToSchool": "Link zur Schule",
                "workExperienceHeading": "Arbeitserfahrungen",
                "paintBtn": "Malen Sie ein Haus",
                "paintDrop": "Im Sommer 2022 habe ich beim Streichen des Hauses mitgeholfen, ich habe gute Arbeit geleistet.",
                "vacuumingBtn": "Staubsaugen",
                "vaccumDrop": "Ich sauge mein Zimmer immer, wenn ich Staub sehe, manchmal sauge ich auch das Haus, wenn mir danach ist.",
                "takeOutTrashBtn": "Bring den Müll raus",
                "takeOutTrashDrop": "Manchmal werfe ich den Müll, den wir draußen haben, in den Mülleimer, aber normalerweise mache ich das nur, wenn ich viel Müll in meinem Zimmer habe, der nicht hineinpasst.",
                "otherJobsHomeBtn": "Andere arbeiten zu Hause",
                "otherJobsHomeDrop": "Normalerweise repariere und installiere ich Dinge im Haus, bisher habe ich feste Türen, Lampen, Computer, Internet und mehr. Außerdem habe ich ein Fenster, Rauchmelder, Jalousien, Heizungen und mehr eingebaut.&#10; Ich räume auch Sachen in die Spülmaschine und wieder heraus und lege Holz in den Ofen. Ich kann auch Feuer machen.",
                "jobsMyRoomBtn": "Ich arbeite in meinem Zimmer",
                "jobsMyRoomDrop": "In meinem Zimmer achte ich immer darauf, dass es ordentlich und ordentlich ist. Ich mache das Bett, staubsauge, wasche Staub, gieße Blumen und lege Kleidung in den Schrank.",
                "hobbiesHeading": "Meine Hobbys",
                "hobbiesText": "Meine Hobbys sind <a href=\"#gaming\">Gaming,</a> <a href=\"#computers\">Computer und</a> <a href=\"#programming\">Programmieren.</a> Etwa 2017 begann ich, mich für Spiele und Computer zu interessieren. Das Programmieren kam ein paar Jahre später. Im Gaming-Bereich mag ich eher ruhige Spiele und Spiele, bei denen man ein wenig nachdenken muss. Die Spiele, die mir am besten gefallen, sind Fabrikspiele.",
                "gamePurchased": "Gekauft: ",
                "hoursPlayed": "Stunden gespielt: ",
                "satisfactoryDesc": "Satisfactory ist ein First-Person-Open-World-Fabrikbauspiel mit einer Prise Erkundung und Kampf. Spielen Sie alleine oder mit Freunden, erkunden Sie einen fremden Planeten, bauen Sie mehrstöckige Fabriken und betreten Sie den Förderbandhimmel!",
                "spaceengineersDesc": "Space Engineers ist ein Sandbox-Spiel über Ingenieurskunst, Bauwesen, Erkundung und Überleben im Weltraum und auf Planeten. Spieler bauen Raumschiffe, Raumstationen, Planetenaußenposten unterschiedlicher Größe und Nutzung, steuern Schiffe und reisen durch den Weltraum, um Planeten zu erkunden und Ressourcen zum Überleben zu sammeln.",
                "dysonsphereprogramDesc": "Bauen Sie die effizienteste intergalaktische Fabrik im Weltraumsimulations-Strategiespiel Dyson Sphere Program! Nutzen Sie die Kraft der Sterne, sammeln Sie Ressourcen, planen und entwerfen Sie Produktionslinien und entwickeln Sie Ihre interstellare Fabrik von einer kleinen Weltraumwerkstatt zu einem galaxisweiten Industrieimperium.",
                "eurotrucksim2Desc": "Reisen Sie als König der Straße durch Europa, als Trucker, der wichtige Fracht über beeindruckende Entfernungen liefert! Bei Dutzenden von Städten, die es zu erkunden gilt, werden Ihre Ausdauer, Ihr Können und Ihre Geschwindigkeit an ihre Grenzen gebracht.",
                "gamesHeading": "Spiele",
                "gamesText": "Hier sind alle Spiele, die ich in HTML und JavaScript erstellt habe",
                "game-start": "Spiel starten",
                "drumKitDesc": "Spielen Sie virtuelle Trommelgeräusche, indem Sie in diesem nicht so fesselnden Schlagzeugspiel Ihre Tastatur verwenden oder jede einzelne Taste drücken.",
                "simonGameDesc": "Testen Sie Ihr Gedächtnis mit einem sich wiederholenden Farbblitz! Mit jeder erfolgreichen Wiederholung wird die Sequenz länger. Wie weit kannst du gehen? Schärfen Sie Ihre Fähigkeiten und genießen Sie das süchtig machende Gameplay!",
                "diceGameDesc": "Suchen Sie nach einer unkomplizierten Möglichkeit, Ihre Angelegenheit zu regeln? Lass einfach die Würfel rollen! Unabhängig davon, ob Sie zu zweit oder mit mehr Spielern spielen, erhält jeder seine eigenen Würfel. Der Spieler, der die höchste Zahl würfelt, gewinnt. Es ist ein einfaches und fesselndes Spiel, das jeder genießen kann!"
            }
        }
    }
}